SELECT * FROM course.exam;
SET FOREIGN_KEY_CHECKS = 0;
TRUNCATE TABLE exam;
SET FOREIGN_KEY_CHECKS = 1;

INSERT INTO exam (q_no, exf_no, status, del_yn) VALUES
-- Midterm - 알고리즘
(1, 1, '응시', 0),
(2, 1, '미응시', 0),
(3, 1, '응시', 0),
(4, 1, '미응시', 0),
(5, 1, '응시', 0),
(6, 1, '응시', 0),

-- Final - 알고리즘
(7, 12, '미응시', 0),
(8, 12, '응시', 0),
(9, 12, '응시', 0),
(10, 12, '응시', 0),

-- Midterm - 자료구조
(11, 2, '응시', 0),
(12, 2, '미응시', 0),
(13, 2, '응시', 0),
(14, 2, '응시', 0),
(15, 2, '응시', 0),
(16, 2, '미응시', 0),

-- Final - 자료구조
(17, 13, '응시', 0),
(18, 13, '응시', 0),
(19, 13, '미응시', 0),
(20, 13, '응시', 0),

-- Midterm - 회로이론
(21, 3, '응시', 0),
(22, 3, '미응시', 0),
(23, 3, '응시', 0),
(24, 3, '미응시', 0);